run/tutorials/multiphase/multiphaseEulerFoam/laminar/bed/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type basicMultiphaseSystem;

phases (air water solid);

air
{
    type            pureIsothermalPhaseModel;
    diameterModel   isothermal;
    isothermalCoeffs
    {
        d0              3e-3;
        p0              1e5;
    }

    residualAlpha   1e-6;
}

water
{
    type            pureIsothermalPhaseModel;
    diameterModel   constant;
    constantCoeffs
    {
        d               1e-4;
    }

    residualAlpha   1e-6;
}

solid
{
    type            pureStationaryIsothermalPhaseModel;
    diameterModel   constant;
    constantCoeffs
    {
        d               1e-2;
    }

    residualAlpha   1e-6;
}

blending
{
    drag
    {
        type            linear;
        minFullyContinuousAlpha.air 0.8;
        minPartlyContinuousAlpha.air 0.5;
        minFullyContinuousAlpha.water 0.8;
        minPartlyContinuousAlpha.water 0.5;
        minFullyContinuousAlpha.solid none;
        minPartlyContinuousAlpha.solid none;
    }

    default
    {
        type            linear;
        minFullyContinuousAlpha.air 0.8;
        minPartlyContinuousAlpha.air 0.2;
        minFullyContinuousAlpha.water 0.8;
        minPartlyContinuousAlpha.water 0.2;
        minFullyContinuousAlpha.solid none;
        minPartlyContinuousAlpha.solid none;
    }
}

surfaceTension
{
    air_water
    {
        type            constant;
        sigma           0.07;
    }
}

drag
{
    air_dispersedIn_water
    {
        type            SchillerNaumann;
        residualRe      1e-3;
    }

    air_segregatedWith_water
    {
        type            segregated;
        m               0.5;
        n               8;
    }

    water_dispersedIn_air
    {
        type            SchillerNaumann;
        residualRe      1e-3;
    }

    air_water_displacedBy_solid
    {
        type            AttouFerschneider;
        gas             air;
        liquid          water;
        solid           solid;
        E1              280;
        E2              4.8;
    }

    solid_dispersedIn_air
    {
        $air_water_displacedBy_solid;
    }

    solid_dispersedIn_water
    {
        $air_water_displacedBy_solid;
    }
}

virtualMass
{
    air_dispersedIn_water
    {
        type            constantCoefficient;
        Cvm             0.5;
    }

    water_dispersedIn_air
    {
        type            constantCoefficient;
        Cvm             0.5;
    }
}

heatTransfer
{}

phaseTransfer
{}

lift
{}

wallLubrication
{}

turbulentDispersion
{}

interfaceCompression
{}

// ************************************************************************* //
